{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "5203f720-a235-4690-b8a4-355bd56bb0ef",
    "lastModifiedDateTime":  "2020-05-28T19:11:04.8401365Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2020-04-09T19:25:35.62637Z",
    "description":  "Start with setting time zone to Central Time. ",
    "displayName":  "Win 10 Set TimeZone to Central with OMA-URI",
    "version":  8,
    "deviceManagementApplicabilityRuleOsEdition":  {
                                                       "osEditionTypes":  [
                                                                              "windows10IoTCore",
                                                                              "windows10IoTCoreCommercial",
                                                                              "windows10Mobile",
                                                                              "windows10MobileEnterprise"
                                                                          ],
                                                       "name":  null,
                                                       "ruleType":  "exclude"
                                                   },
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingString",
                            "displayName":  "Set Time zone to Central",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/Policy/Config/TimeLanguageSettings/ConfigureTimeZone",
                            "value":  "Central Standard Time"
                        }
                    ]
}
